Revit 2024 API
PerformanceAdviser.GetPerformanceAdviser Method
 Returns the only instance of PerformanceAdviser in the Application.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static PerformanceAdviser GetPerformanceAdviser()
Visual Basic
Public Shared Function GetPerformanceAdviser As PerformanceAdviser
Visual C++
public:
static PerformanceAdviser^ GetPerformanceAdviser()
Return Value
 The only instance of PerformanceAdviser in the Application.
See Also
PerformanceAdviser Class
Autodesk.Revit.DB Namespace